# Built In Failures Rebar Failures Rebar End Treatment Over Hook Property

Source: https://www.revitapidocs.com/2026/46d3d7ac-7816-7436-4569-17c090bba0fb.htm

---

| Built In Failures Rebar Failures Rebar End Treatment Over Hook Property |
| --- |

Cannot add end treatment to the end that already has a hook.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarEndTreatmentOverHook { get; }
```

```
Public Shared ReadOnly Property RebarEndTreatmentOverHook As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarEndTreatmentOverHook {
	FailureDefinitionId^ get ();
}
```

```
static member RebarEndTreatmentOverHook : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace